# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [1,5, 5,7, 3,12]  # P3/8
  - [10,11, 6,18, 10,28]  # P4/16
  - [20,17, 25,36, 51,64]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Inception_Conv, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 1]],  # 1
   [-1, 1, space_to_depth, [1]],   # 2 -P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 1]],  # 4
   [-1, 1, space_to_depth, [1]],   # 5-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 1]],  #7
   [-1, 1, space_to_depth, [1]],   # 8-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 1]],  # 10-P5/32
   [-1, 1, SimSPPF, [1024, 13]], 
   [-1, 1, SPPCSPC, [1024, 13]],  # 12
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 16

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 20 (P3/8-small)

   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, space_to_depth, [1]],   
   [[-1, 17], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 24 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 1]],
   [-1, 1, space_to_depth, [1]],   
   [[-1, 13], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 28 (P5/32-large)

   [[20, 24, 28], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
